Repository: sleepcha/T-Stocks
Catalog: TinkoffStocks/Resources/Localizable.xcstrings
Source language: ru
Languages: en

# AccountCell.sinceLastCloseTitle
source: за сегодня
en: today

# AccountCell.sincePurchaseTitle
source: за всё время
en: all time

# CandleStickInterval.day
source: День
en: Day

# CandleStickInterval.hour1
source: Ч1
en: H1

# CandleStickInterval.hour4
source: Ч4
en: H4

# CandleStickInterval.min5
source: М5
en: M5

# CandleStickInterval.min15
source: М15
en: M15

# CandleStickInterval.min30
source: М30
en: M30

# CandleStickInterval.month
source: Месяц
en: Month

# CandleStickInterval.week
source: Неделя
en: Week

# HTTPClientCacheError.cacheExpired
source: Кэшированный ответ больше не является актуальным
en: The cached response has expired and is no longer valid

# HTTPClientCacheError.cacheMiss
source: Запрашиваемый ответ не найден в кэше
en: The requested response was not found in the cache

# HTTPClientError.emptyData
source: Не получено данных от сервера. %@
en: No data received. %@

# HTTPClientError.emptyResponse
source: Пустой ответ
en: Empty response

# HTTPClientError.httpError
source: Ошибка %@
en: Error %@

# HTTPClientError.invalidHTTPResponse
source: Некорректный HTTP ответ
en: Invalid HTTP response

# HTTPClientError.networkError
source: Ошибка сети: %@
en: Network error: %@

# LoginPresenter.helpDialog.cancelButton.title
source: Отмена
en: Cancel

# LoginPresenter.helpDialog.goButton.title
source: Перейти
en: Open Safari

# LoginPresenter.helpDialog.text
source: Для получения токена необходимо перейти в личный кабинет Т-Инвестиций
en: You will be redirected to your T-Investments account to create the token

# LoginPresenter.helpDialog.title
source: Токен Invest API
en: Invest API token

# LoginViewUI.loginButton.title
source: Войти
en: Login

# LoginViewUI.rememberMeLabel.text
source: Запомнить меня
en: Remember me

# LoginViewUI.sandboxLabel.text
source: Режим песочницы
en: Sandbox mode

# LoginViewUI.subtitle
source: Для входа в Т-Инвестиции
en: To login to T-Investments

# LoginViewUI.title
source: Введите токен
en: Enter token

# LoginViewUI.tokenField.placeholder
source: Ваш токен Invest API
en: Your Invest API token

# LogoRepositoryError.invalidImage
source: Неверный формат изображения
en: Invalid image format

# LogoRepositoryError.invalidURL
source: Неверный URL
en: Invalid URL

# MoneyFormatter.amountSuffix
source: шт
en: pcs

# MoneyFormatter.futuresSuffix
source: пт.
en: pt.

# MoneyFormatter.metalWeightSuffix
source: г
en: g

# NetworkManagerError.badRequest
source: Запрос составлен неверно, проверьте параметры
en: Malformed request. Verify parameters

# NetworkManagerError.connectionLost
source: Соединение с сервером было потеряно, попробуйте повторить запрос позже
en: Connection to the server was lost, please try again later

# NetworkManagerError.forbidden
source: Недостаточно прав для выполнения запроса, проверьте соответствие токена и передаваемого в запросе счета
en: Insufficient permissions. Verify the token and the provided account

# NetworkManagerError.httpError
source: Ошибка HTTP %lld
en: HTTP error %lld

# NetworkManagerError.invalidResponse
source: Пустой или некорректный HTTP ответ
en: Empty or invalid HTTP response

# NetworkManagerError.jsonError
source: Ошибка сериализации JSON
en: JSON serialization error

# NetworkManagerError.networkError
source: Ошибка сети: %@
en: Network error: %@

# NetworkManagerError.notFound
source: Неверный URL запроса или переданный параметр не определен
en: Invalid URL or item not found

# NetworkManagerError.timedOut
source: Превышен лимит времени на запрос
en: The request timed out

# NetworkManagerError.tooManyRequests
source: Превышен лимит запросов в минуту
en: Request limit per minute exceeded

# NetworkManagerError.unauthorized
source: Токен доступа не найден или не активен
en: Access token not found or invalid

# PortfolioErrorView.refreshButtonTitle
source: Обновить
en: Refresh

# PortfolioFlow.tabBarItem.title
source: Портфель
en: Portfolio

# PortfolioPresenter.logoutDialog.cancelButtonTitle
source: Отмена
en: Cancel

# PortfolioPresenter.logoutDialog.logoutButtonTitle
source: Выйти
en: Log out

# PortfolioPresenter.logoutDialog.text
source: Токен будет удалён с вашего устройства, для входа нужно будет ввести его заново
en: The token will be removed from your device, you will need to enter it again to log in

# PortfolioPresenter.logoutDialog.title
source: Вы действительно хотите выйти?
en: Are you sure you want to log out?

# PortfolioPresenter.sections.bonds
source: Облигации
en: Bonds

# PortfolioPresenter.sections.currencies
source: Валюта и металлы
en: Currencies and metals

# PortfolioPresenter.sections.etfs
source: Фонды
en: ETFs

# PortfolioPresenter.sections.future
source: Фьючерсы
en: Futures

# PortfolioPresenter.sections.options
source: Опционы
en: Options

# PortfolioPresenter.sections.other
source: Другое
en: Other

# PortfolioPresenter.sections.shares
source: Акции
en: Shares

# PortfolioPresenter.sections.structuredProducts
source: Структурные ноты
en: Structured products

# PortfolioService.emptyAssetName
source: Неизвестный актив
en: Unknown asset

# PortfolioViewController.logoutButtonTitle
source: Выйти
en: Log out

# PortfolioViewController.menuTitle
source: Меню
en: Menu

# RepositoryError.networkError
source: Ошибка при получении данных, проверьте ваше интернет-соединение
en: Please check your internet connection

# RepositoryError.serverError
source: Сервис временно недоступен. Повторите, пожалуйста, позже
en: Service is temporarily unavailable. Please try again later

# RepositoryError.taskCancelled
source: Операция отменена
en: Task was cancelled

# RepositoryError.tooManyRequests
source: Слишком много запросов.\nПопробуйте позже
en: Too many requests. Try again later

# RepositoryError.unauthorized
source: Ошибка доступа. Проверьте режим и срок действия токена
en: Access error. Please check the mode and token's expiration date

# SandboxService.anotherNewAccountName
source: ИИС
en: IRA

# SandboxService.newAccountName
source: Брокерский счёт
en: Brokerage account

source: В портфеле
en: Your portfolios

source: Купить
en: Buy

source: Обновить
en: Refresh

source: Продать
en: Sell

source: Стоимость бумаг в портфеле
en: Asset value in portfolio
